# PressureDrop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..PressureDrop Property
PipePressureDropData Class See Also
---
The pressure drop of the pipe. Units: (kg/(ft·s²)).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double PressureDrop { get; set; }
```

Visual Basic
---
```text
Public Property PressureDrop As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double PressureDrop {
	double get ();
	void set (double value);
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace